espressif/esp-idf/components/soc/esp32p4/include/soc/lp_sys_reg.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LPSYSREG_LP_SYS_VER_DATE_REG register
 *  need_des
 */
#define LPSYSREG_LP_SYS_VER_DATE_REG (DR_REG_LP_SYS_BASE + 0x0)
/** LPSYSREG_VER_DATE : R/W; bitpos: [31:0]; default: 539165961;
 *  need_des
 */
#define LPSYSREG_VER_DATE    0xFFFFFFFFU
#define LPSYSREG_VER_DATE_M  (LPSYSREG_VER_DATE_V << LPSYSREG_VER_DATE_S)
#define LPSYSREG_VER_DATE_V  0xFFFFFFFFU
#define LPSYSREG_VER_DATE_S  0

/** LPSYSREG_CLK_SEL_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_CLK_SEL_CTRL_REG (DR_REG_LP_SYS_BASE + 0x4)
/** LPSYSREG_ENA_SW_SEL_SYS_CLK : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define LPSYSREG_ENA_SW_SEL_SYS_CLK    (BIT(16))
#define LPSYSREG_ENA_SW_SEL_SYS_CLK_M  (LPSYSREG_ENA_SW_SEL_SYS_CLK_V << LPSYSREG_ENA_SW_SEL_SYS_CLK_S)
#define LPSYSREG_ENA_SW_SEL_SYS_CLK_V  0x00000001U
#define LPSYSREG_ENA_SW_SEL_SYS_CLK_S  16
/** LPSYSREG_SW_SYS_CLK_SRC_SEL : R/W; bitpos: [17]; default: 0;
 *  reserved
 */
#define LPSYSREG_SW_SYS_CLK_SRC_SEL    (BIT(17))
#define LPSYSREG_SW_SYS_CLK_SRC_SEL_M  (LPSYSREG_SW_SYS_CLK_SRC_SEL_V << LPSYSREG_SW_SYS_CLK_SRC_SEL_S)
#define LPSYSREG_SW_SYS_CLK_SRC_SEL_V  0x00000001U
#define LPSYSREG_SW_SYS_CLK_SRC_SEL_S  17

/** LPSYSREG_SYS_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_SYS_CTRL_REG (DR_REG_LP_SYS_BASE + 0x8)
/** LPSYSREG_LP_CORE_DISABLE : R/W; bitpos: [0]; default: 0;
 *  lp cpu disable
 */
#define LPSYSREG_LP_CORE_DISABLE    (BIT(0))
#define LPSYSREG_LP_CORE_DISABLE_M  (LPSYSREG_LP_CORE_DISABLE_V << LPSYSREG_LP_CORE_DISABLE_S)
#define LPSYSREG_LP_CORE_DISABLE_V  0x00000001U
#define LPSYSREG_LP_CORE_DISABLE_S  0
/** LPSYSREG_SYS_SW_RST : WT; bitpos: [1]; default: 0;
 *  digital system software reset bit
 */
#define LPSYSREG_SYS_SW_RST    (BIT(1))
#define LPSYSREG_SYS_SW_RST_M  (LPSYSREG_SYS_SW_RST_V << LPSYSREG_SYS_SW_RST_S)
#define LPSYSREG_SYS_SW_RST_V  0x00000001U
#define LPSYSREG_SYS_SW_RST_S  1
/** LPSYSREG_FORCE_DOWNLOAD_BOOT : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define LPSYSREG_FORCE_DOWNLOAD_BOOT    (BIT(2))
#define LPSYSREG_FORCE_DOWNLOAD_BOOT_M  (LPSYSREG_FORCE_DOWNLOAD_BOOT_V << LPSYSREG_FORCE_DOWNLOAD_BOOT_S)
#define LPSYSREG_FORCE_DOWNLOAD_BOOT_V  0x00000001U
#define LPSYSREG_FORCE_DOWNLOAD_BOOT_S  2
/** LPSYSREG_DIG_FIB : R/W; bitpos: [10:3]; default: 255;
 *  need_des
 */
#define LPSYSREG_DIG_FIB    0x000000FFU
#define LPSYSREG_DIG_FIB_M  (LPSYSREG_DIG_FIB_V << LPSYSREG_DIG_FIB_S)
#define LPSYSREG_DIG_FIB_V  0x000000FFU
#define LPSYSREG_DIG_FIB_S  3
/** LPSYSREG_IO_MUX_RESET_DISABLE : R/W; bitpos: [11]; default: 0;
 *  reset disable bit for LP IOMUX
 */
#define LPSYSREG_IO_MUX_RESET_DISABLE    (BIT(11))
#define LPSYSREG_IO_MUX_RESET_DISABLE_M  (LPSYSREG_IO_MUX_RESET_DISABLE_V << LPSYSREG_IO_MUX_RESET_DISABLE_S)
#define LPSYSREG_IO_MUX_RESET_DISABLE_V  0x00000001U
#define LPSYSREG_IO_MUX_RESET_DISABLE_S  11
/** LPSYSREG_ANA_FIB : RO; bitpos: [20:14]; default: 127;
 *  need_des
 */
#define LPSYSREG_ANA_FIB    0x0000007FU
#define LPSYSREG_ANA_FIB_M  (LPSYSREG_ANA_FIB_V << LPSYSREG_ANA_FIB_S)
#define LPSYSREG_ANA_FIB_V  0x0000007FU
#define LPSYSREG_ANA_FIB_S  14
/** LPSYSREG_LP_FIB_SEL : R/W; bitpos: [28:21]; default: 255;
 *  need_des
 */
#define LPSYSREG_LP_FIB_SEL    0x000000FFU
#define LPSYSREG_LP_FIB_SEL_M  (LPSYSREG_LP_FIB_SEL_V << LPSYSREG_LP_FIB_SEL_S)
#define LPSYSREG_LP_FIB_SEL_V  0x000000FFU
#define LPSYSREG_LP_FIB_SEL_S  21
/** LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_CLR : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_CLR    (BIT(29))
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_CLR_M  (LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_CLR_V << LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_CLR_S)
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_CLR_V  0x00000001U
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_CLR_S  29
/** LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG : R/WTC/SS; bitpos: [30]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG    (BIT(30))
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_M  (LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_V << LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_S)
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_V  0x00000001U
#define LPSYSREG_LP_CORE_ETM_WAKEUP_FLAG_S  30
/** LPSYSREG_SYSTIMER_STALL_SEL : R/W; bitpos: [31]; default: 0;
 *  0: use systimer_stall signal from hp_core0, 1: use systimer_stall signal from
 *  hp_core1
 */
#define LPSYSREG_SYSTIMER_STALL_SEL    (BIT(31))
#define LPSYSREG_SYSTIMER_STALL_SEL_M  (LPSYSREG_SYSTIMER_STALL_SEL_V << LPSYSREG_SYSTIMER_STALL_SEL_S)
#define LPSYSREG_SYSTIMER_STALL_SEL_V  0x00000001U
#define LPSYSREG_SYSTIMER_STALL_SEL_S  31

/** LPSYSREG_LP_CLK_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_LP_CLK_CTRL_REG (DR_REG_LP_SYS_BASE + 0xc)
/** LPSYSREG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define LPSYSREG_CLK_EN    (BIT(0))
#define LPSYSREG_CLK_EN_M  (LPSYSREG_CLK_EN_V << LPSYSREG_CLK_EN_S)
#define LPSYSREG_CLK_EN_V  0x00000001U
#define LPSYSREG_CLK_EN_S  0
/** LPSYSREG_LP_FOSC_HP_CKEN : R/W; bitpos: [14]; default: 1;
 *  reserved
 */
#define LPSYSREG_LP_FOSC_HP_CKEN    (BIT(14))
#define LPSYSREG_LP_FOSC_HP_CKEN_M  (LPSYSREG_LP_FOSC_HP_CKEN_V << LPSYSREG_LP_FOSC_HP_CKEN_S)
#define LPSYSREG_LP_FOSC_HP_CKEN_V  0x00000001U
#define LPSYSREG_LP_FOSC_HP_CKEN_S  14

/** LPSYSREG_LP_RST_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_LP_RST_CTRL_REG (DR_REG_LP_SYS_BASE + 0x10)
/** LPSYSREG_ANA_RST_BYPASS : R/W; bitpos: [0]; default: 1;
 *  analog source reset bypass : wdt,brown out,super wdt,glitch
 */
#define LPSYSREG_ANA_RST_BYPASS    (BIT(0))
#define LPSYSREG_ANA_RST_BYPASS_M  (LPSYSREG_ANA_RST_BYPASS_V << LPSYSREG_ANA_RST_BYPASS_S)
#define LPSYSREG_ANA_RST_BYPASS_V  0x00000001U
#define LPSYSREG_ANA_RST_BYPASS_S  0
/** LPSYSREG_SYS_RST_BYPASS : R/W; bitpos: [1]; default: 1;
 *  system source reset bypass : software reset,hp wdt,lp wdt,efuse
 */
#define LPSYSREG_SYS_RST_BYPASS    (BIT(1))
#define LPSYSREG_SYS_RST_BYPASS_M  (LPSYSREG_SYS_RST_BYPASS_V << LPSYSREG_SYS_RST_BYPASS_S)
#define LPSYSREG_SYS_RST_BYPASS_V  0x00000001U
#define LPSYSREG_SYS_RST_BYPASS_S  1
/** LPSYSREG_EFUSE_FORCE_NORST : R/W; bitpos: [2]; default: 0;
 *  efuse force no reset control
 */
#define LPSYSREG_EFUSE_FORCE_NORST    (BIT(2))
#define LPSYSREG_EFUSE_FORCE_NORST_M  (LPSYSREG_EFUSE_FORCE_NORST_V << LPSYSREG_EFUSE_FORCE_NORST_S)
#define LPSYSREG_EFUSE_FORCE_NORST_V  0x00000001U
#define LPSYSREG_EFUSE_FORCE_NORST_S  2

