espressif/esp-idf/components/soc/esp32p4/include/soc/lp_sys_reg.h
/** LPSYSREG_LP_CORE_BOOT_ADDR_REG register
 *  need_des
 */
#define LPSYSREG_LP_CORE_BOOT_ADDR_REG (DR_REG_LP_SYS_BASE + 0x18)
/** LPSYSREG_LP_CPU_BOOT_ADDR : R/W; bitpos: [31:0]; default: 1343225856;
 *  need_des
 */
#define LPSYSREG_LP_CPU_BOOT_ADDR    0xFFFFFFFFU
#define LPSYSREG_LP_CPU_BOOT_ADDR_M  (LPSYSREG_LP_CPU_BOOT_ADDR_V << LPSYSREG_LP_CPU_BOOT_ADDR_S)
#define LPSYSREG_LP_CPU_BOOT_ADDR_V  0xFFFFFFFFU
#define LPSYSREG_LP_CPU_BOOT_ADDR_S  0

/** LPSYSREG_EXT_WAKEUP1_REG register
 *  need_des
 */
#define LPSYSREG_EXT_WAKEUP1_REG (DR_REG_LP_SYS_BASE + 0x1c)
/** LPSYSREG_EXT_WAKEUP1_SEL : R/W; bitpos: [15:0]; default: 0;
 *  Bitmap to select RTC pads for ext wakeup1
 */
#define LPSYSREG_EXT_WAKEUP1_SEL    0x0000FFFFU
#define LPSYSREG_EXT_WAKEUP1_SEL_M  (LPSYSREG_EXT_WAKEUP1_SEL_V << LPSYSREG_EXT_WAKEUP1_SEL_S)
#define LPSYSREG_EXT_WAKEUP1_SEL_V  0x0000FFFFU
#define LPSYSREG_EXT_WAKEUP1_SEL_S  0
/** LPSYSREG_EXT_WAKEUP1_STATUS_CLR : WT; bitpos: [16]; default: 0;
 *  clear ext wakeup1 status
 */
#define LPSYSREG_EXT_WAKEUP1_STATUS_CLR    (BIT(16))
#define LPSYSREG_EXT_WAKEUP1_STATUS_CLR_M  (LPSYSREG_EXT_WAKEUP1_STATUS_CLR_V << LPSYSREG_EXT_WAKEUP1_STATUS_CLR_S)
#define LPSYSREG_EXT_WAKEUP1_STATUS_CLR_V  0x00000001U
#define LPSYSREG_EXT_WAKEUP1_STATUS_CLR_S  16

/** LPSYSREG_EXT_WAKEUP1_STATUS_REG register
 *  need_des
 */
#define LPSYSREG_EXT_WAKEUP1_STATUS_REG (DR_REG_LP_SYS_BASE + 0x20)
/** LPSYSREG_EXT_WAKEUP1_STATUS : RO; bitpos: [15:0]; default: 0;
 *  ext wakeup1 status
 */
#define LPSYSREG_EXT_WAKEUP1_STATUS    0x0000FFFFU
#define LPSYSREG_EXT_WAKEUP1_STATUS_M  (LPSYSREG_EXT_WAKEUP1_STATUS_V << LPSYSREG_EXT_WAKEUP1_STATUS_S)
#define LPSYSREG_EXT_WAKEUP1_STATUS_V  0x0000FFFFU
#define LPSYSREG_EXT_WAKEUP1_STATUS_S  0

/** LPSYSREG_LP_TCM_PWR_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_LP_TCM_PWR_CTRL_REG (DR_REG_LP_SYS_BASE + 0x24)
/** LPSYSREG_LP_TCM_ROM_CLK_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_CLK_FORCE_ON    (BIT(5))
#define LPSYSREG_LP_TCM_ROM_CLK_FORCE_ON_M  (LPSYSREG_LP_TCM_ROM_CLK_FORCE_ON_V << LPSYSREG_LP_TCM_ROM_CLK_FORCE_ON_S)
#define LPSYSREG_LP_TCM_ROM_CLK_FORCE_ON_V  0x00000001U
#define LPSYSREG_LP_TCM_ROM_CLK_FORCE_ON_S  5
/** LPSYSREG_LP_TCM_RAM_CLK_FORCE_ON : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_CLK_FORCE_ON    (BIT(7))
#define LPSYSREG_LP_TCM_RAM_CLK_FORCE_ON_M  (LPSYSREG_LP_TCM_RAM_CLK_FORCE_ON_V << LPSYSREG_LP_TCM_RAM_CLK_FORCE_ON_S)
#define LPSYSREG_LP_TCM_RAM_CLK_FORCE_ON_V  0x00000001U
#define LPSYSREG_LP_TCM_RAM_CLK_FORCE_ON_S  7

/** LPSYSREG_BOOT_ADDR_HP_LP_REG_REG register
 *  need_des
 */
#define LPSYSREG_BOOT_ADDR_HP_LP_REG_REG (DR_REG_LP_SYS_BASE + 0x28)
/** LPSYSREG_BOOT_ADDR_HP_LP : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_BOOT_ADDR_HP_LP    0xFFFFFFFFU
#define LPSYSREG_BOOT_ADDR_HP_LP_M  (LPSYSREG_BOOT_ADDR_HP_LP_V << LPSYSREG_BOOT_ADDR_HP_LP_S)
#define LPSYSREG_BOOT_ADDR_HP_LP_V  0xFFFFFFFFU
#define LPSYSREG_BOOT_ADDR_HP_LP_S  0

/** LPSYSREG_LP_STORE0_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE0_REG (DR_REG_LP_SYS_BASE + 0x2c)
/** LPSYSREG_LP_SCRATCH0 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH0    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH0_M  (LPSYSREG_LP_SCRATCH0_V << LPSYSREG_LP_SCRATCH0_S)
#define LPSYSREG_LP_SCRATCH0_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH0_S  0

/** LPSYSREG_LP_STORE1_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE1_REG (DR_REG_LP_SYS_BASE + 0x30)
/** LPSYSREG_LP_SCRATCH1 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH1    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH1_M  (LPSYSREG_LP_SCRATCH1_V << LPSYSREG_LP_SCRATCH1_S)
#define LPSYSREG_LP_SCRATCH1_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH1_S  0

/** LPSYSREG_LP_STORE2_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE2_REG (DR_REG_LP_SYS_BASE + 0x34)
/** LPSYSREG_LP_SCRATCH2 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH2    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH2_M  (LPSYSREG_LP_SCRATCH2_V << LPSYSREG_LP_SCRATCH2_S)
#define LPSYSREG_LP_SCRATCH2_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH2_S  0

/** LPSYSREG_LP_STORE3_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE3_REG (DR_REG_LP_SYS_BASE + 0x38)
/** LPSYSREG_LP_SCRATCH3 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH3    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH3_M  (LPSYSREG_LP_SCRATCH3_V << LPSYSREG_LP_SCRATCH3_S)
#define LPSYSREG_LP_SCRATCH3_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH3_S  0

/** LPSYSREG_LP_STORE4_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE4_REG (DR_REG_LP_SYS_BASE + 0x3c)
/** LPSYSREG_LP_SCRATCH4 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH4    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH4_M  (LPSYSREG_LP_SCRATCH4_V << LPSYSREG_LP_SCRATCH4_S)
#define LPSYSREG_LP_SCRATCH4_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH4_S  0

/** LPSYSREG_LP_STORE5_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE5_REG (DR_REG_LP_SYS_BASE + 0x40)
/** LPSYSREG_LP_SCRATCH5 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH5    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH5_M  (LPSYSREG_LP_SCRATCH5_V << LPSYSREG_LP_SCRATCH5_S)
#define LPSYSREG_LP_SCRATCH5_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH5_S  0

/** LPSYSREG_LP_STORE6_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE6_REG (DR_REG_LP_SYS_BASE + 0x44)
/** LPSYSREG_LP_SCRATCH6 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH6    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH6_M  (LPSYSREG_LP_SCRATCH6_V << LPSYSREG_LP_SCRATCH6_S)
#define LPSYSREG_LP_SCRATCH6_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH6_S  0

/** LPSYSREG_LP_STORE7_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE7_REG (DR_REG_LP_SYS_BASE + 0x48)
/** LPSYSREG_LP_SCRATCH7 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH7    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH7_M  (LPSYSREG_LP_SCRATCH7_V << LPSYSREG_LP_SCRATCH7_S)
#define LPSYSREG_LP_SCRATCH7_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH7_S  0

/** LPSYSREG_LP_STORE8_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE8_REG (DR_REG_LP_SYS_BASE + 0x4c)
/** LPSYSREG_LP_SCRATCH8 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH8    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH8_M  (LPSYSREG_LP_SCRATCH8_V << LPSYSREG_LP_SCRATCH8_S)
#define LPSYSREG_LP_SCRATCH8_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH8_S  0

/** LPSYSREG_LP_STORE9_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE9_REG (DR_REG_LP_SYS_BASE + 0x50)
/** LPSYSREG_LP_SCRATCH9 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH9    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH9_M  (LPSYSREG_LP_SCRATCH9_V << LPSYSREG_LP_SCRATCH9_S)
#define LPSYSREG_LP_SCRATCH9_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH9_S  0

