espressif/esp-idf/components/soc/esp32p4/include/soc/lp_sys_reg.h
/** LPSYSREG_LP_STORE10_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE10_REG (DR_REG_LP_SYS_BASE + 0x54)
/** LPSYSREG_LP_SCRATCH10 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH10    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH10_M  (LPSYSREG_LP_SCRATCH10_V << LPSYSREG_LP_SCRATCH10_S)
#define LPSYSREG_LP_SCRATCH10_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH10_S  0

/** LPSYSREG_LP_STORE11_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE11_REG (DR_REG_LP_SYS_BASE + 0x58)
/** LPSYSREG_LP_SCRATCH11 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH11    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH11_M  (LPSYSREG_LP_SCRATCH11_V << LPSYSREG_LP_SCRATCH11_S)
#define LPSYSREG_LP_SCRATCH11_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH11_S  0

/** LPSYSREG_LP_STORE12_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE12_REG (DR_REG_LP_SYS_BASE + 0x5c)
/** LPSYSREG_LP_SCRATCH12 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH12    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH12_M  (LPSYSREG_LP_SCRATCH12_V << LPSYSREG_LP_SCRATCH12_S)
#define LPSYSREG_LP_SCRATCH12_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH12_S  0

/** LPSYSREG_LP_STORE13_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE13_REG (DR_REG_LP_SYS_BASE + 0x60)
/** LPSYSREG_LP_SCRATCH13 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH13    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH13_M  (LPSYSREG_LP_SCRATCH13_V << LPSYSREG_LP_SCRATCH13_S)
#define LPSYSREG_LP_SCRATCH13_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH13_S  0

/** LPSYSREG_LP_STORE14_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE14_REG (DR_REG_LP_SYS_BASE + 0x64)
/** LPSYSREG_LP_SCRATCH14 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH14    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH14_M  (LPSYSREG_LP_SCRATCH14_V << LPSYSREG_LP_SCRATCH14_S)
#define LPSYSREG_LP_SCRATCH14_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH14_S  0

/** LPSYSREG_LP_STORE15_REG register
 *  need_des
 */
#define LPSYSREG_LP_STORE15_REG (DR_REG_LP_SYS_BASE + 0x68)
/** LPSYSREG_LP_SCRATCH15 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_SCRATCH15    0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH15_M  (LPSYSREG_LP_SCRATCH15_V << LPSYSREG_LP_SCRATCH15_S)
#define LPSYSREG_LP_SCRATCH15_V  0xFFFFFFFFU
#define LPSYSREG_LP_SCRATCH15_S  0

/** LPSYSREG_LP_PROBEA_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_LP_PROBEA_CTRL_REG (DR_REG_LP_SYS_BASE + 0x6c)
/** LPSYSREG_PROBE_A_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_A_MOD_SEL    0x0000FFFFU
#define LPSYSREG_PROBE_A_MOD_SEL_M  (LPSYSREG_PROBE_A_MOD_SEL_V << LPSYSREG_PROBE_A_MOD_SEL_S)
#define LPSYSREG_PROBE_A_MOD_SEL_V  0x0000FFFFU
#define LPSYSREG_PROBE_A_MOD_SEL_S  0
/** LPSYSREG_PROBE_A_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_A_TOP_SEL    0x000000FFU
#define LPSYSREG_PROBE_A_TOP_SEL_M  (LPSYSREG_PROBE_A_TOP_SEL_V << LPSYSREG_PROBE_A_TOP_SEL_S)
#define LPSYSREG_PROBE_A_TOP_SEL_V  0x000000FFU
#define LPSYSREG_PROBE_A_TOP_SEL_S  16
/** LPSYSREG_PROBE_L_SEL : R/W; bitpos: [25:24]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_L_SEL    0x00000003U
#define LPSYSREG_PROBE_L_SEL_M  (LPSYSREG_PROBE_L_SEL_V << LPSYSREG_PROBE_L_SEL_S)
#define LPSYSREG_PROBE_L_SEL_V  0x00000003U
#define LPSYSREG_PROBE_L_SEL_S  24
/** LPSYSREG_PROBE_H_SEL : R/W; bitpos: [27:26]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_H_SEL    0x00000003U
#define LPSYSREG_PROBE_H_SEL_M  (LPSYSREG_PROBE_H_SEL_V << LPSYSREG_PROBE_H_SEL_S)
#define LPSYSREG_PROBE_H_SEL_V  0x00000003U
#define LPSYSREG_PROBE_H_SEL_S  26
/** LPSYSREG_PROBE_GLOBAL_EN : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_GLOBAL_EN    (BIT(28))
#define LPSYSREG_PROBE_GLOBAL_EN_M  (LPSYSREG_PROBE_GLOBAL_EN_V << LPSYSREG_PROBE_GLOBAL_EN_S)
#define LPSYSREG_PROBE_GLOBAL_EN_V  0x00000001U
#define LPSYSREG_PROBE_GLOBAL_EN_S  28

/** LPSYSREG_LP_PROBEB_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_LP_PROBEB_CTRL_REG (DR_REG_LP_SYS_BASE + 0x70)
/** LPSYSREG_PROBE_B_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_B_MOD_SEL    0x0000FFFFU
#define LPSYSREG_PROBE_B_MOD_SEL_M  (LPSYSREG_PROBE_B_MOD_SEL_V << LPSYSREG_PROBE_B_MOD_SEL_S)
#define LPSYSREG_PROBE_B_MOD_SEL_V  0x0000FFFFU
#define LPSYSREG_PROBE_B_MOD_SEL_S  0
/** LPSYSREG_PROBE_B_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_B_TOP_SEL    0x000000FFU
#define LPSYSREG_PROBE_B_TOP_SEL_M  (LPSYSREG_PROBE_B_TOP_SEL_V << LPSYSREG_PROBE_B_TOP_SEL_S)
#define LPSYSREG_PROBE_B_TOP_SEL_V  0x000000FFU
#define LPSYSREG_PROBE_B_TOP_SEL_S  16
/** LPSYSREG_PROBE_B_EN : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_B_EN    (BIT(24))
#define LPSYSREG_PROBE_B_EN_M  (LPSYSREG_PROBE_B_EN_V << LPSYSREG_PROBE_B_EN_S)
#define LPSYSREG_PROBE_B_EN_V  0x00000001U
#define LPSYSREG_PROBE_B_EN_S  24

/** LPSYSREG_LP_PROBE_OUT_REG register
 *  need_des
 */
#define LPSYSREG_LP_PROBE_OUT_REG (DR_REG_LP_SYS_BASE + 0x74)
/** LPSYSREG_PROBE_TOP_OUT : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_PROBE_TOP_OUT    0xFFFFFFFFU
#define LPSYSREG_PROBE_TOP_OUT_M  (LPSYSREG_PROBE_TOP_OUT_V << LPSYSREG_PROBE_TOP_OUT_S)
#define LPSYSREG_PROBE_TOP_OUT_V  0xFFFFFFFFU
#define LPSYSREG_PROBE_TOP_OUT_S  0

/** LPSYSREG_F2S_APB_BRG_CNTL_REG register
 *  need_des
 */
#define LPSYSREG_F2S_APB_BRG_CNTL_REG (DR_REG_LP_SYS_BASE + 0x9c)
/** LPSYSREG_F2S_APB_POSTW_EN : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define LPSYSREG_F2S_APB_POSTW_EN    (BIT(0))
#define LPSYSREG_F2S_APB_POSTW_EN_M  (LPSYSREG_F2S_APB_POSTW_EN_V << LPSYSREG_F2S_APB_POSTW_EN_S)
#define LPSYSREG_F2S_APB_POSTW_EN_V  0x00000001U
#define LPSYSREG_F2S_APB_POSTW_EN_S  0

/** LPSYSREG_USB_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_USB_CTRL_REG (DR_REG_LP_SYS_BASE + 0x100)
/** LPSYSREG_SW_HW_USB_PHY_SEL : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LPSYSREG_SW_HW_USB_PHY_SEL    (BIT(0))
#define LPSYSREG_SW_HW_USB_PHY_SEL_M  (LPSYSREG_SW_HW_USB_PHY_SEL_V << LPSYSREG_SW_HW_USB_PHY_SEL_S)
#define LPSYSREG_SW_HW_USB_PHY_SEL_V  0x00000001U
#define LPSYSREG_SW_HW_USB_PHY_SEL_S  0
/** LPSYSREG_SW_USB_PHY_SEL : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define LPSYSREG_SW_USB_PHY_SEL    (BIT(1))
#define LPSYSREG_SW_USB_PHY_SEL_M  (LPSYSREG_SW_USB_PHY_SEL_V << LPSYSREG_SW_USB_PHY_SEL_S)
#define LPSYSREG_SW_USB_PHY_SEL_V  0x00000001U
#define LPSYSREG_SW_USB_PHY_SEL_S  1
/** LPSYSREG_USBOTG20_WAKEUP_CLR : WT; bitpos: [2]; default: 0;
 *  clear usb wakeup to PMU.
 */
#define LPSYSREG_USBOTG20_WAKEUP_CLR    (BIT(2))
#define LPSYSREG_USBOTG20_WAKEUP_CLR_M  (LPSYSREG_USBOTG20_WAKEUP_CLR_V << LPSYSREG_USBOTG20_WAKEUP_CLR_S)
#define LPSYSREG_USBOTG20_WAKEUP_CLR_V  0x00000001U
#define LPSYSREG_USBOTG20_WAKEUP_CLR_S  2
/** LPSYSREG_USBOTG20_IN_SUSPEND : R/W; bitpos: [3]; default: 0;
 *  indicate usb otg2.0 is in suspend state.
 */
#define LPSYSREG_USBOTG20_IN_SUSPEND    (BIT(3))
#define LPSYSREG_USBOTG20_IN_SUSPEND_M  (LPSYSREG_USBOTG20_IN_SUSPEND_V << LPSYSREG_USBOTG20_IN_SUSPEND_S)
#define LPSYSREG_USBOTG20_IN_SUSPEND_V  0x00000001U
#define LPSYSREG_USBOTG20_IN_SUSPEND_S  3

