espressif/esp-idf/components/soc/esp32p4/include/soc/lp_sys_reg.h
/** LPSYSREG_ANA_XPD_PAD_GROUP_REG register
 *  need_des
 */
#define LPSYSREG_ANA_XPD_PAD_GROUP_REG (DR_REG_LP_SYS_BASE + 0x10c)
/** LPSYSREG_ANA_REG_XPD_PAD_GROUP : R/W; bitpos: [7:0]; default: 255;
 *  Set 1 to power up pad group
 */
#define LPSYSREG_ANA_REG_XPD_PAD_GROUP    0x000000FFU
#define LPSYSREG_ANA_REG_XPD_PAD_GROUP_M  (LPSYSREG_ANA_REG_XPD_PAD_GROUP_V << LPSYSREG_ANA_REG_XPD_PAD_GROUP_S)
#define LPSYSREG_ANA_REG_XPD_PAD_GROUP_V  0x000000FFU
#define LPSYSREG_ANA_REG_XPD_PAD_GROUP_S  0

/** LPSYSREG_LP_TCM_RAM_RDN_ECO_CS_REG register
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_CS_REG (DR_REG_LP_SYS_BASE + 0x110)
/** LPSYSREG_LP_TCM_RAM_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_EN    (BIT(0))
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_EN_M  (LPSYSREG_LP_TCM_RAM_RDN_ECO_EN_V << LPSYSREG_LP_TCM_RAM_RDN_ECO_EN_S)
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_EN_V  0x00000001U
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_EN_S  0
/** LPSYSREG_LP_TCM_RAM_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_RESULT    (BIT(1))
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_RESULT_M  (LPSYSREG_LP_TCM_RAM_RDN_ECO_RESULT_V << LPSYSREG_LP_TCM_RAM_RDN_ECO_RESULT_S)
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_RESULT_V  0x00000001U
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_RESULT_S  1

/** LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x114)
/** LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW    0xFFFFFFFFU
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW_M  (LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW_V << LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW_S)
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_LOW_S  0

/** LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x118)
/** LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH    0xFFFFFFFFU
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH_M  (LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH_V << LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH_S)
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LPSYSREG_LP_TCM_RAM_RDN_ECO_HIGH_S  0

/** LPSYSREG_LP_TCM_ROM_RDN_ECO_CS_REG register
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_CS_REG (DR_REG_LP_SYS_BASE + 0x11c)
/** LPSYSREG_LP_TCM_ROM_RDN_ECO_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_EN    (BIT(0))
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_EN_M  (LPSYSREG_LP_TCM_ROM_RDN_ECO_EN_V << LPSYSREG_LP_TCM_ROM_RDN_ECO_EN_S)
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_EN_V  0x00000001U
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_EN_S  0
/** LPSYSREG_LP_TCM_ROM_RDN_ECO_RESULT : RO; bitpos: [1]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_RESULT    (BIT(1))
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_RESULT_M  (LPSYSREG_LP_TCM_ROM_RDN_ECO_RESULT_V << LPSYSREG_LP_TCM_ROM_RDN_ECO_RESULT_S)
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_RESULT_V  0x00000001U
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_RESULT_S  1

/** LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x120)
/** LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW    0xFFFFFFFFU
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW_M  (LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW_V << LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW_S)
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_LOW_S  0

/** LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x124)
/** LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH    0xFFFFFFFFU
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH_M  (LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH_V << LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH_S)
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LPSYSREG_LP_TCM_ROM_RDN_ECO_HIGH_S  0

/** LPSYSREG_HP_ROOT_CLK_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_HP_ROOT_CLK_CTRL_REG (DR_REG_LP_SYS_BASE + 0x130)
/** LPSYSREG_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  clock gate enable for hp cpu root 400M clk
 */
#define LPSYSREG_CPU_CLK_EN    (BIT(0))
#define LPSYSREG_CPU_CLK_EN_M  (LPSYSREG_CPU_CLK_EN_V << LPSYSREG_CPU_CLK_EN_S)
#define LPSYSREG_CPU_CLK_EN_V  0x00000001U
#define LPSYSREG_CPU_CLK_EN_S  0
/** LPSYSREG_SYS_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  clock gate enable for hp sys root 480M clk
 */
#define LPSYSREG_SYS_CLK_EN    (BIT(1))
#define LPSYSREG_SYS_CLK_EN_M  (LPSYSREG_SYS_CLK_EN_V << LPSYSREG_SYS_CLK_EN_S)
#define LPSYSREG_SYS_CLK_EN_V  0x00000001U
#define LPSYSREG_SYS_CLK_EN_S  1

/** LPSYSREG_LP_PMU_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LPSYSREG_LP_PMU_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x138)
/** LPSYSREG_PMU_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_PMU_RDN_ECO_LOW    0xFFFFFFFFU
#define LPSYSREG_PMU_RDN_ECO_LOW_M  (LPSYSREG_PMU_RDN_ECO_LOW_V << LPSYSREG_PMU_RDN_ECO_LOW_S)
#define LPSYSREG_PMU_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LPSYSREG_PMU_RDN_ECO_LOW_S  0

/** LPSYSREG_LP_PMU_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LPSYSREG_LP_PMU_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x13c)
/** LPSYSREG_PMU_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LPSYSREG_PMU_RDN_ECO_HIGH    0xFFFFFFFFU
#define LPSYSREG_PMU_RDN_ECO_HIGH_M  (LPSYSREG_PMU_RDN_ECO_HIGH_V << LPSYSREG_PMU_RDN_ECO_HIGH_S)
#define LPSYSREG_PMU_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LPSYSREG_PMU_RDN_ECO_HIGH_S  0

/** LPSYSREG_PAD_COMP0_REG register
 *  need_des
 */
#define LPSYSREG_PAD_COMP0_REG (DR_REG_LP_SYS_BASE + 0x148)
/** LPSYSREG_DREF_COMP0 : R/W; bitpos: [2:0]; default: 0;
 *  pad comp dref
 */
#define LPSYSREG_DREF_COMP0    0x00000007U
#define LPSYSREG_DREF_COMP0_M  (LPSYSREG_DREF_COMP0_V << LPSYSREG_DREF_COMP0_S)
#define LPSYSREG_DREF_COMP0_V  0x00000007U
#define LPSYSREG_DREF_COMP0_S  0
/** LPSYSREG_MODE_COMP0 : R/W; bitpos: [3]; default: 0;
 *  pad comp mode
 */
#define LPSYSREG_MODE_COMP0    (BIT(3))
#define LPSYSREG_MODE_COMP0_M  (LPSYSREG_MODE_COMP0_V << LPSYSREG_MODE_COMP0_S)
#define LPSYSREG_MODE_COMP0_V  0x00000001U
#define LPSYSREG_MODE_COMP0_S  3
/** LPSYSREG_XPD_COMP0 : R/W; bitpos: [4]; default: 0;
 *  pad comp xpd
 */
#define LPSYSREG_XPD_COMP0    (BIT(4))
#define LPSYSREG_XPD_COMP0_M  (LPSYSREG_XPD_COMP0_V << LPSYSREG_XPD_COMP0_S)
#define LPSYSREG_XPD_COMP0_V  0x00000001U
#define LPSYSREG_XPD_COMP0_S  4

