espressif/esp-idf/components/soc/esp32p4/include/soc/lp_sys_reg.h
/** LPSYSREG_PAD_COMP1_REG register
 *  need_des
 */
#define LPSYSREG_PAD_COMP1_REG (DR_REG_LP_SYS_BASE + 0x14c)
/** LPSYSREG_DREF_COMP1 : R/W; bitpos: [2:0]; default: 0;
 *  pad comp dref
 */
#define LPSYSREG_DREF_COMP1    0x00000007U
#define LPSYSREG_DREF_COMP1_M  (LPSYSREG_DREF_COMP1_V << LPSYSREG_DREF_COMP1_S)
#define LPSYSREG_DREF_COMP1_V  0x00000007U
#define LPSYSREG_DREF_COMP1_S  0
/** LPSYSREG_MODE_COMP1 : R/W; bitpos: [3]; default: 0;
 *  pad comp mode
 */
#define LPSYSREG_MODE_COMP1    (BIT(3))
#define LPSYSREG_MODE_COMP1_M  (LPSYSREG_MODE_COMP1_V << LPSYSREG_MODE_COMP1_S)
#define LPSYSREG_MODE_COMP1_V  0x00000001U
#define LPSYSREG_MODE_COMP1_S  3
/** LPSYSREG_XPD_COMP1 : R/W; bitpos: [4]; default: 0;
 *  pad comp xpd
 */
#define LPSYSREG_XPD_COMP1    (BIT(4))
#define LPSYSREG_XPD_COMP1_M  (LPSYSREG_XPD_COMP1_V << LPSYSREG_XPD_COMP1_S)
#define LPSYSREG_XPD_COMP1_V  0x00000001U
#define LPSYSREG_XPD_COMP1_S  4

/** LPSYSREG_BACKUP_DMA_CFG0_REG register
 *  need_des
 */
#define LPSYSREG_BACKUP_DMA_CFG0_REG (DR_REG_LP_SYS_BASE + 0x154)
/** LPSYSREG_BURST_LIMIT_AON : R/W; bitpos: [4:0]; default: 10;
 *  need_des
 */
#define LPSYSREG_BURST_LIMIT_AON    0x0000001FU
#define LPSYSREG_BURST_LIMIT_AON_M  (LPSYSREG_BURST_LIMIT_AON_V << LPSYSREG_BURST_LIMIT_AON_S)
#define LPSYSREG_BURST_LIMIT_AON_V  0x0000001FU
#define LPSYSREG_BURST_LIMIT_AON_S  0
/** LPSYSREG_READ_INTERVAL_AON : R/W; bitpos: [11:5]; default: 10;
 *  need_des
 */
#define LPSYSREG_READ_INTERVAL_AON    0x0000007FU
#define LPSYSREG_READ_INTERVAL_AON_M  (LPSYSREG_READ_INTERVAL_AON_V << LPSYSREG_READ_INTERVAL_AON_S)
#define LPSYSREG_READ_INTERVAL_AON_V  0x0000007FU
#define LPSYSREG_READ_INTERVAL_AON_S  5
/** LPSYSREG_LINK_BACKUP_TOUT_THRES_AON : R/W; bitpos: [21:12]; default: 100;
 *  need_des
 */
#define LPSYSREG_LINK_BACKUP_TOUT_THRES_AON    0x000003FFU
#define LPSYSREG_LINK_BACKUP_TOUT_THRES_AON_M  (LPSYSREG_LINK_BACKUP_TOUT_THRES_AON_V << LPSYSREG_LINK_BACKUP_TOUT_THRES_AON_S)
#define LPSYSREG_LINK_BACKUP_TOUT_THRES_AON_V  0x000003FFU
#define LPSYSREG_LINK_BACKUP_TOUT_THRES_AON_S  12
/** LPSYSREG_LINK_TOUT_THRES_AON : R/W; bitpos: [31:22]; default: 100;
 *  need_des
 */
#define LPSYSREG_LINK_TOUT_THRES_AON    0x000003FFU
#define LPSYSREG_LINK_TOUT_THRES_AON_M  (LPSYSREG_LINK_TOUT_THRES_AON_V << LPSYSREG_LINK_TOUT_THRES_AON_S)
#define LPSYSREG_LINK_TOUT_THRES_AON_V  0x000003FFU
#define LPSYSREG_LINK_TOUT_THRES_AON_S  22

/** LPSYSREG_BACKUP_DMA_CFG1_REG register
 *  need_des
 */
#define LPSYSREG_BACKUP_DMA_CFG1_REG (DR_REG_LP_SYS_BASE + 0x158)
/** LPSYSREG_AON_BYPASS : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LPSYSREG_AON_BYPASS    (BIT(31))
#define LPSYSREG_AON_BYPASS_M  (LPSYSREG_AON_BYPASS_V << LPSYSREG_AON_BYPASS_S)
#define LPSYSREG_AON_BYPASS_V  0x00000001U
#define LPSYSREG_AON_BYPASS_S  31

/** LPSYSREG_BACKUP_DMA_CFG2_REG register
 *  need_des
 */
#define LPSYSREG_BACKUP_DMA_CFG2_REG (DR_REG_LP_SYS_BASE + 0x15c)
/** LPSYSREG_LINK_ADDR_AON : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LINK_ADDR_AON    0xFFFFFFFFU
#define LPSYSREG_LINK_ADDR_AON_M  (LPSYSREG_LINK_ADDR_AON_V << LPSYSREG_LINK_ADDR_AON_S)
#define LPSYSREG_LINK_ADDR_AON_V  0xFFFFFFFFU
#define LPSYSREG_LINK_ADDR_AON_S  0

/** LPSYSREG_BOOT_ADDR_HP_CORE1_REG register
 *  need_des
 */
#define LPSYSREG_BOOT_ADDR_HP_CORE1_REG (DR_REG_LP_SYS_BASE + 0x164)
/** LPSYSREG_BOOT_ADDR_HP_CORE1 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_BOOT_ADDR_HP_CORE1    0xFFFFFFFFU
#define LPSYSREG_BOOT_ADDR_HP_CORE1_M  (LPSYSREG_BOOT_ADDR_HP_CORE1_V << LPSYSREG_BOOT_ADDR_HP_CORE1_S)
#define LPSYSREG_BOOT_ADDR_HP_CORE1_V  0xFFFFFFFFU
#define LPSYSREG_BOOT_ADDR_HP_CORE1_S  0

/** LPSYSREG_LP_ADDRHOLE_ADDR_REG register
 *  need_des
 */
#define LPSYSREG_LP_ADDRHOLE_ADDR_REG (DR_REG_LP_SYS_BASE + 0x168)
/** LPSYSREG_LP_ADDRHOLE_ADDR : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_ADDRHOLE_ADDR    0xFFFFFFFFU
#define LPSYSREG_LP_ADDRHOLE_ADDR_M  (LPSYSREG_LP_ADDRHOLE_ADDR_V << LPSYSREG_LP_ADDRHOLE_ADDR_S)
#define LPSYSREG_LP_ADDRHOLE_ADDR_V  0xFFFFFFFFU
#define LPSYSREG_LP_ADDRHOLE_ADDR_S  0

/** LPSYSREG_LP_ADDRHOLE_INFO_REG register
 *  need_des
 */
#define LPSYSREG_LP_ADDRHOLE_INFO_REG (DR_REG_LP_SYS_BASE + 0x16c)
/** LPSYSREG_LP_ADDRHOLE_ID : RO; bitpos: [4:0]; default: 0;
 *  master id: 5'h0: hp core0, 5'h1:hp core1, 5'h2:lp core, 5'h3:usb otg11, 5'h4:
 *  regdma, 5'h5: gmac, 5'h5 sdmmc, 5'h7: usbotg20, 5'h8: trace0, 5'h9: trace1, 5'ha
 *  tcm monitor, 5'hb: l2mem monitor. 5'h10~5'h1f: ahb pdma.
 */
#define LPSYSREG_LP_ADDRHOLE_ID    0x0000001FU
#define LPSYSREG_LP_ADDRHOLE_ID_M  (LPSYSREG_LP_ADDRHOLE_ID_V << LPSYSREG_LP_ADDRHOLE_ID_S)
#define LPSYSREG_LP_ADDRHOLE_ID_V  0x0000001FU
#define LPSYSREG_LP_ADDRHOLE_ID_S  0
/** LPSYSREG_LP_ADDRHOLE_WR : RO; bitpos: [5]; default: 0;
 *  1:write trans, 0: read trans.
 */
#define LPSYSREG_LP_ADDRHOLE_WR    (BIT(5))
#define LPSYSREG_LP_ADDRHOLE_WR_M  (LPSYSREG_LP_ADDRHOLE_WR_V << LPSYSREG_LP_ADDRHOLE_WR_S)
#define LPSYSREG_LP_ADDRHOLE_WR_V  0x00000001U
#define LPSYSREG_LP_ADDRHOLE_WR_S  5
/** LPSYSREG_LP_ADDRHOLE_SECURE : RO; bitpos: [6]; default: 0;
 *  1: illegal address access, 0: access without permission
 */
#define LPSYSREG_LP_ADDRHOLE_SECURE    (BIT(6))
#define LPSYSREG_LP_ADDRHOLE_SECURE_M  (LPSYSREG_LP_ADDRHOLE_SECURE_V << LPSYSREG_LP_ADDRHOLE_SECURE_S)
#define LPSYSREG_LP_ADDRHOLE_SECURE_V  0x00000001U
#define LPSYSREG_LP_ADDRHOLE_SECURE_S  6

/** LPSYSREG_INT_RAW_REG register
 *  raw interrupt register
 */
#define LPSYSREG_INT_RAW_REG (DR_REG_LP_SYS_BASE + 0x170)
/** LPSYSREG_LP_ADDRHOLE_INT_RAW : R/SS/WTC; bitpos: [0]; default: 0;
 *  the raw interrupt status of lp addrhole(for lp peri  and lp ram tee apm, and lp
 *  matrix default slave)
 */
#define LPSYSREG_LP_ADDRHOLE_INT_RAW    (BIT(0))
#define LPSYSREG_LP_ADDRHOLE_INT_RAW_M  (LPSYSREG_LP_ADDRHOLE_INT_RAW_V << LPSYSREG_LP_ADDRHOLE_INT_RAW_S)
#define LPSYSREG_LP_ADDRHOLE_INT_RAW_V  0x00000001U
#define LPSYSREG_LP_ADDRHOLE_INT_RAW_S  0
/** LPSYSREG_IDBUS_ADDRHOLE_INT_RAW : R/SS/WTC; bitpos: [1]; default: 0;
 *  the raw interrupt status of idbus addrhole(only for lp cpu ibus and dbus)
 */
#define LPSYSREG_IDBUS_ADDRHOLE_INT_RAW    (BIT(1))
#define LPSYSREG_IDBUS_ADDRHOLE_INT_RAW_M  (LPSYSREG_IDBUS_ADDRHOLE_INT_RAW_V << LPSYSREG_IDBUS_ADDRHOLE_INT_RAW_S)
#define LPSYSREG_IDBUS_ADDRHOLE_INT_RAW_V  0x00000001U
#define LPSYSREG_IDBUS_ADDRHOLE_INT_RAW_S  1
/** LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [2]; default: 0;
 *  the raw interrupt status of lp core ahb bus timeout
 */
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_RAW    (BIT(2))
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_RAW_M  (LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_RAW_V << LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_RAW_S)
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_RAW_V  0x00000001U
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_RAW_S  2
/** LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [3]; default: 0;
 *  the raw interrupt status of lp core  ibus timeout
 */
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_RAW    (BIT(3))
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_RAW_M  (LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_RAW_V << LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_RAW_S)
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_RAW_S  3
/** LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [4]; default: 0;
 *  the raw interrupt status of lp core  dbus timeout
 */
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_RAW    (BIT(4))
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_RAW_M  (LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_RAW_V << LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_RAW_S)
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_RAW_S  4
/** LPSYSREG_ETM_TASK_ULP_INT_RAW : R/SS/WTC; bitpos: [5]; default: 0;
 *  the raw interrupt status of etm task ulp
 */
#define LPSYSREG_ETM_TASK_ULP_INT_RAW    (BIT(5))
#define LPSYSREG_ETM_TASK_ULP_INT_RAW_M  (LPSYSREG_ETM_TASK_ULP_INT_RAW_V << LPSYSREG_ETM_TASK_ULP_INT_RAW_S)
#define LPSYSREG_ETM_TASK_ULP_INT_RAW_V  0x00000001U
#define LPSYSREG_ETM_TASK_ULP_INT_RAW_S  5
/** LPSYSREG_SLOW_CLK_TICK_INT_RAW : R/SS/WTC; bitpos: [6]; default: 0;
 *  the raw interrupt status of slow_clk_tick
 */
#define LPSYSREG_SLOW_CLK_TICK_INT_RAW    (BIT(6))
#define LPSYSREG_SLOW_CLK_TICK_INT_RAW_M  (LPSYSREG_SLOW_CLK_TICK_INT_RAW_V << LPSYSREG_SLOW_CLK_TICK_INT_RAW_S)
#define LPSYSREG_SLOW_CLK_TICK_INT_RAW_V  0x00000001U
#define LPSYSREG_SLOW_CLK_TICK_INT_RAW_S  6

/** LPSYSREG_INT_ST_REG register
 *  masked interrupt register
 */
#define LPSYSREG_INT_ST_REG (DR_REG_LP_SYS_BASE + 0x174)
/** LPSYSREG_LP_ADDRHOLE_INT_ST : RO; bitpos: [0]; default: 0;
 *  the masked interrupt status of lp addrhole (for lp peri  and lp ram tee apm, and lp
 *  matrix default slave)
 */
#define LPSYSREG_LP_ADDRHOLE_INT_ST    (BIT(0))
#define LPSYSREG_LP_ADDRHOLE_INT_ST_M  (LPSYSREG_LP_ADDRHOLE_INT_ST_V << LPSYSREG_LP_ADDRHOLE_INT_ST_S)
#define LPSYSREG_LP_ADDRHOLE_INT_ST_V  0x00000001U
#define LPSYSREG_LP_ADDRHOLE_INT_ST_S  0
/** LPSYSREG_IDBUS_ADDRHOLE_INT_ST : RO; bitpos: [1]; default: 0;
 *  the masked interrupt status of idbus addrhole(only for lp cpu ibus and dbus)
 */
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ST    (BIT(1))
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ST_M  (LPSYSREG_IDBUS_ADDRHOLE_INT_ST_V << LPSYSREG_IDBUS_ADDRHOLE_INT_ST_S)
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ST_V  0x00000001U
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ST_S  1
/** LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ST : RO; bitpos: [2]; default: 0;
 *  the masked interrupt status of lp core ahb bus timeout
 */
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ST    (BIT(2))
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ST_M  (LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ST_V << LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ST_S)
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ST_V  0x00000001U
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ST_S  2
/** LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ST : RO; bitpos: [3]; default: 0;
 *  the masked interrupt status of lp core  ibus timeout
 */
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ST    (BIT(3))
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ST_M  (LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ST_V << LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ST_S)
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ST_V  0x00000001U
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ST_S  3
/** LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ST : RO; bitpos: [4]; default: 0;
 *  the masked interrupt status of lp core  dbus timeout
 */
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ST    (BIT(4))
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ST_M  (LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ST_V << LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ST_S)
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ST_V  0x00000001U
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ST_S  4
/** LPSYSREG_ETM_TASK_ULP_INT_ST : RO; bitpos: [5]; default: 0;
 *  the masked interrupt status of etm task ulp
 */
#define LPSYSREG_ETM_TASK_ULP_INT_ST    (BIT(5))
#define LPSYSREG_ETM_TASK_ULP_INT_ST_M  (LPSYSREG_ETM_TASK_ULP_INT_ST_V << LPSYSREG_ETM_TASK_ULP_INT_ST_S)
#define LPSYSREG_ETM_TASK_ULP_INT_ST_V  0x00000001U
#define LPSYSREG_ETM_TASK_ULP_INT_ST_S  5
/** LPSYSREG_SLOW_CLK_TICK_INT_ST : RO; bitpos: [6]; default: 0;
 *  the masked interrupt status of slow_clk_tick
 */
#define LPSYSREG_SLOW_CLK_TICK_INT_ST    (BIT(6))
#define LPSYSREG_SLOW_CLK_TICK_INT_ST_M  (LPSYSREG_SLOW_CLK_TICK_INT_ST_V << LPSYSREG_SLOW_CLK_TICK_INT_ST_S)
#define LPSYSREG_SLOW_CLK_TICK_INT_ST_V  0x00000001U
#define LPSYSREG_SLOW_CLK_TICK_INT_ST_S  6

/** LPSYSREG_INT_ENA_REG register
 *  masked interrupt register
 */
#define LPSYSREG_INT_ENA_REG (DR_REG_LP_SYS_BASE + 0x178)
/** LPSYSREG_LP_ADDRHOLE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable lp addrhole int
 */
#define LPSYSREG_LP_ADDRHOLE_INT_ENA    (BIT(0))
#define LPSYSREG_LP_ADDRHOLE_INT_ENA_M  (LPSYSREG_LP_ADDRHOLE_INT_ENA_V << LPSYSREG_LP_ADDRHOLE_INT_ENA_S)
#define LPSYSREG_LP_ADDRHOLE_INT_ENA_V  0x00000001U
#define LPSYSREG_LP_ADDRHOLE_INT_ENA_S  0
/** LPSYSREG_IDBUS_ADDRHOLE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable idbus addrhole int
 */
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ENA    (BIT(1))
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ENA_M  (LPSYSREG_IDBUS_ADDRHOLE_INT_ENA_V << LPSYSREG_IDBUS_ADDRHOLE_INT_ENA_S)
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ENA_V  0x00000001U
#define LPSYSREG_IDBUS_ADDRHOLE_INT_ENA_S  1
/** LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable lp_core_ahb_timeout int
 */
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ENA    (BIT(2))
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ENA_M  (LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ENA_V << LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ENA_S)
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ENA_V  0x00000001U
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_ENA_S  2
/** LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable lp_core_ibus_timeout int
 */
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ENA    (BIT(3))
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ENA_M  (LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ENA_V << LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ENA_S)
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_ENA_S  3
/** LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to enable lp_core_dbus_timeout int
 */
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ENA    (BIT(4))
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ENA_M  (LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ENA_V << LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ENA_S)
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_ENA_S  4
/** LPSYSREG_ETM_TASK_ULP_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable etm task ulp int
 */
#define LPSYSREG_ETM_TASK_ULP_INT_ENA    (BIT(5))
#define LPSYSREG_ETM_TASK_ULP_INT_ENA_M  (LPSYSREG_ETM_TASK_ULP_INT_ENA_V << LPSYSREG_ETM_TASK_ULP_INT_ENA_S)
#define LPSYSREG_ETM_TASK_ULP_INT_ENA_V  0x00000001U
#define LPSYSREG_ETM_TASK_ULP_INT_ENA_S  5
/** LPSYSREG_SLOW_CLK_TICK_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to enable slow_clk_tick int
 */
#define LPSYSREG_SLOW_CLK_TICK_INT_ENA    (BIT(6))
#define LPSYSREG_SLOW_CLK_TICK_INT_ENA_M  (LPSYSREG_SLOW_CLK_TICK_INT_ENA_V << LPSYSREG_SLOW_CLK_TICK_INT_ENA_S)
#define LPSYSREG_SLOW_CLK_TICK_INT_ENA_V  0x00000001U
#define LPSYSREG_SLOW_CLK_TICK_INT_ENA_S  6

/** LPSYSREG_INT_CLR_REG register
 *  interrupt clear register
 */
#define LPSYSREG_INT_CLR_REG (DR_REG_LP_SYS_BASE + 0x17c)
/** LPSYSREG_LP_ADDRHOLE_INT_CLR : WT; bitpos: [0]; default: 0;
 *  write 1 to clear lp addrhole int
 */
#define LPSYSREG_LP_ADDRHOLE_INT_CLR    (BIT(0))
#define LPSYSREG_LP_ADDRHOLE_INT_CLR_M  (LPSYSREG_LP_ADDRHOLE_INT_CLR_V << LPSYSREG_LP_ADDRHOLE_INT_CLR_S)
#define LPSYSREG_LP_ADDRHOLE_INT_CLR_V  0x00000001U
#define LPSYSREG_LP_ADDRHOLE_INT_CLR_S  0
/** LPSYSREG_IDBUS_ADDRHOLE_INT_CLR : WT; bitpos: [1]; default: 0;
 *  write 1 to clear idbus addrhole int
 */
#define LPSYSREG_IDBUS_ADDRHOLE_INT_CLR    (BIT(1))
#define LPSYSREG_IDBUS_ADDRHOLE_INT_CLR_M  (LPSYSREG_IDBUS_ADDRHOLE_INT_CLR_V << LPSYSREG_IDBUS_ADDRHOLE_INT_CLR_S)
#define LPSYSREG_IDBUS_ADDRHOLE_INT_CLR_V  0x00000001U
#define LPSYSREG_IDBUS_ADDRHOLE_INT_CLR_S  1
/** LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear lp_core_ahb_timeout int
 */
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_CLR    (BIT(2))
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_CLR_M  (LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_CLR_V << LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_CLR_S)
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_CLR_V  0x00000001U
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_INT_CLR_S  2
/** LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear lp_core_ibus_timeout int
 */
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_CLR    (BIT(3))
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_CLR_M  (LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_CLR_V << LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_CLR_S)
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_INT_CLR_S  3
/** LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear lp_core_dbus_timeout int
 */
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_CLR    (BIT(4))
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_CLR_M  (LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_CLR_V << LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_CLR_S)
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_INT_CLR_S  4
/** LPSYSREG_ETM_TASK_ULP_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear etm tasl ulp int
 */
#define LPSYSREG_ETM_TASK_ULP_INT_CLR    (BIT(5))
#define LPSYSREG_ETM_TASK_ULP_INT_CLR_M  (LPSYSREG_ETM_TASK_ULP_INT_CLR_V << LPSYSREG_ETM_TASK_ULP_INT_CLR_S)
#define LPSYSREG_ETM_TASK_ULP_INT_CLR_V  0x00000001U
#define LPSYSREG_ETM_TASK_ULP_INT_CLR_S  5
/** LPSYSREG_SLOW_CLK_TICK_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear slow_clk_tick int
 */
#define LPSYSREG_SLOW_CLK_TICK_INT_CLR    (BIT(6))
#define LPSYSREG_SLOW_CLK_TICK_INT_CLR_M  (LPSYSREG_SLOW_CLK_TICK_INT_CLR_V << LPSYSREG_SLOW_CLK_TICK_INT_CLR_S)
#define LPSYSREG_SLOW_CLK_TICK_INT_CLR_V  0x00000001U
#define LPSYSREG_SLOW_CLK_TICK_INT_CLR_S  6

/** LPSYSREG_HP_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_HP_MEM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x180)
/** LPSYSREG_HP_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define LPSYSREG_HP_MEM_AUX_CTRL    0xFFFFFFFFU
#define LPSYSREG_HP_MEM_AUX_CTRL_M  (LPSYSREG_HP_MEM_AUX_CTRL_V << LPSYSREG_HP_MEM_AUX_CTRL_S)
#define LPSYSREG_HP_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define LPSYSREG_HP_MEM_AUX_CTRL_S  0

/** LPSYSREG_LP_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_LP_MEM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x184)
/** LPSYSREG_LP_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define LPSYSREG_LP_MEM_AUX_CTRL    0xFFFFFFFFU
#define LPSYSREG_LP_MEM_AUX_CTRL_M  (LPSYSREG_LP_MEM_AUX_CTRL_V << LPSYSREG_LP_MEM_AUX_CTRL_S)
#define LPSYSREG_LP_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define LPSYSREG_LP_MEM_AUX_CTRL_S  0

/** LPSYSREG_HP_ROM_AUX_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_HP_ROM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x188)
/** LPSYSREG_HP_ROM_AUX_CTRL : R/W; bitpos: [31:0]; default: 112;
 *  need_des
 */
#define LPSYSREG_HP_ROM_AUX_CTRL    0xFFFFFFFFU
#define LPSYSREG_HP_ROM_AUX_CTRL_M  (LPSYSREG_HP_ROM_AUX_CTRL_V << LPSYSREG_HP_ROM_AUX_CTRL_S)
#define LPSYSREG_HP_ROM_AUX_CTRL_V  0xFFFFFFFFU
#define LPSYSREG_HP_ROM_AUX_CTRL_S  0

/** LPSYSREG_LP_ROM_AUX_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_LP_ROM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x18c)
/** LPSYSREG_LP_ROM_AUX_CTRL : R/W; bitpos: [31:0]; default: 112;
 *  need_des
 */
#define LPSYSREG_LP_ROM_AUX_CTRL    0xFFFFFFFFU
#define LPSYSREG_LP_ROM_AUX_CTRL_M  (LPSYSREG_LP_ROM_AUX_CTRL_V << LPSYSREG_LP_ROM_AUX_CTRL_S)
#define LPSYSREG_LP_ROM_AUX_CTRL_V  0xFFFFFFFFU
#define LPSYSREG_LP_ROM_AUX_CTRL_S  0

