espressif/esp-idf/components/soc/esp32p4/include/soc/lp_sys_reg.h
/** LPSYSREG_LP_CPU_DBG_PC_REG register
 *  need_des
 */
#define LPSYSREG_LP_CPU_DBG_PC_REG (DR_REG_LP_SYS_BASE + 0x190)
/** LPSYSREG_LP_CPU_DBG_PC : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_CPU_DBG_PC    0xFFFFFFFFU
#define LPSYSREG_LP_CPU_DBG_PC_M  (LPSYSREG_LP_CPU_DBG_PC_V << LPSYSREG_LP_CPU_DBG_PC_S)
#define LPSYSREG_LP_CPU_DBG_PC_V  0xFFFFFFFFU
#define LPSYSREG_LP_CPU_DBG_PC_S  0

/** LPSYSREG_LP_CPU_EXC_PC_REG register
 *  need_des
 */
#define LPSYSREG_LP_CPU_EXC_PC_REG (DR_REG_LP_SYS_BASE + 0x194)
/** LPSYSREG_LP_CPU_EXC_PC : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_LP_CPU_EXC_PC    0xFFFFFFFFU
#define LPSYSREG_LP_CPU_EXC_PC_M  (LPSYSREG_LP_CPU_EXC_PC_V << LPSYSREG_LP_CPU_EXC_PC_S)
#define LPSYSREG_LP_CPU_EXC_PC_V  0xFFFFFFFFU
#define LPSYSREG_LP_CPU_EXC_PC_S  0

/** LPSYSREG_IDBUS_ADDRHOLE_ADDR_REG register
 *  need_des
 */
#define LPSYSREG_IDBUS_ADDRHOLE_ADDR_REG (DR_REG_LP_SYS_BASE + 0x198)
/** LPSYSREG_IDBUS_ADDRHOLE_ADDR : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_IDBUS_ADDRHOLE_ADDR    0xFFFFFFFFU
#define LPSYSREG_IDBUS_ADDRHOLE_ADDR_M  (LPSYSREG_IDBUS_ADDRHOLE_ADDR_V << LPSYSREG_IDBUS_ADDRHOLE_ADDR_S)
#define LPSYSREG_IDBUS_ADDRHOLE_ADDR_V  0xFFFFFFFFU
#define LPSYSREG_IDBUS_ADDRHOLE_ADDR_S  0

/** LPSYSREG_IDBUS_ADDRHOLE_INFO_REG register
 *  need_des
 */
#define LPSYSREG_IDBUS_ADDRHOLE_INFO_REG (DR_REG_LP_SYS_BASE + 0x19c)
/** LPSYSREG_IDBUS_ADDRHOLE_ID : RO; bitpos: [4:0]; default: 0;
 *  need_des
 */
#define LPSYSREG_IDBUS_ADDRHOLE_ID    0x0000001FU
#define LPSYSREG_IDBUS_ADDRHOLE_ID_M  (LPSYSREG_IDBUS_ADDRHOLE_ID_V << LPSYSREG_IDBUS_ADDRHOLE_ID_S)
#define LPSYSREG_IDBUS_ADDRHOLE_ID_V  0x0000001FU
#define LPSYSREG_IDBUS_ADDRHOLE_ID_S  0
/** LPSYSREG_IDBUS_ADDRHOLE_WR : RO; bitpos: [5]; default: 0;
 *  need_des
 */
#define LPSYSREG_IDBUS_ADDRHOLE_WR    (BIT(5))
#define LPSYSREG_IDBUS_ADDRHOLE_WR_M  (LPSYSREG_IDBUS_ADDRHOLE_WR_V << LPSYSREG_IDBUS_ADDRHOLE_WR_S)
#define LPSYSREG_IDBUS_ADDRHOLE_WR_V  0x00000001U
#define LPSYSREG_IDBUS_ADDRHOLE_WR_S  5
/** LPSYSREG_IDBUS_ADDRHOLE_SECURE : RO; bitpos: [6]; default: 0;
 *  need_des
 */
#define LPSYSREG_IDBUS_ADDRHOLE_SECURE    (BIT(6))
#define LPSYSREG_IDBUS_ADDRHOLE_SECURE_M  (LPSYSREG_IDBUS_ADDRHOLE_SECURE_V << LPSYSREG_IDBUS_ADDRHOLE_SECURE_S)
#define LPSYSREG_IDBUS_ADDRHOLE_SECURE_V  0x00000001U
#define LPSYSREG_IDBUS_ADDRHOLE_SECURE_S  6

/** LPSYSREG_HP_POR_RST_BYPASS_CTRL_REG register
 *  need_des
 */
#define LPSYSREG_HP_POR_RST_BYPASS_CTRL_REG (DR_REG_LP_SYS_BASE + 0x1a0)
/** LPSYSREG_HP_PO_CNNT_RSTN_BYPASS_CTRL : R/W; bitpos: [15:8]; default: 255;
 *  [15] 1'b1: po_cnnt_rstn bypass sys_sw_rstn
 *  [14] 1'b1: po_cnnt_rstn bypass hp_wdt_sys_rstn
 *  [13] 1'b1: po_cnnt_rstn bypass hp_cpu_intrusion_rstn
 *  [12] 1'b1: po_cnnt_rstn bypass hp_sdio_sys_rstn
 *  [11] 1'b1: po_cnnt_rstn bypass usb_jtag_chip_rst
 *  [10] 1'b1: po_cnnt_rstn bypass usb_uart_chip_rst
 *  [9] 1'b1: po_cnnt_rstn bypass lp_wdt_hp_sys_rstn
 *  [8] 1'b1: po_cnnt_rstn bypass efuse_err_rstn
 */
#define LPSYSREG_HP_PO_CNNT_RSTN_BYPASS_CTRL    0x000000FFU
#define LPSYSREG_HP_PO_CNNT_RSTN_BYPASS_CTRL_M  (LPSYSREG_HP_PO_CNNT_RSTN_BYPASS_CTRL_V << LPSYSREG_HP_PO_CNNT_RSTN_BYPASS_CTRL_S)
#define LPSYSREG_HP_PO_CNNT_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LPSYSREG_HP_PO_CNNT_RSTN_BYPASS_CTRL_S  8
/** LPSYSREG_HP_PO_RSTN_BYPASS_CTRL : R/W; bitpos: [31:24]; default: 255;
 *  [31] 1'b1: po_rstn bypass sys_sw_rstn
 *  [30] 1'b1: po_rstn bypass hp_wdt_sys_rstn
 *  [29] 1'b1: po_rstn bypass hp_cpu_intrusion_rstn
 *  [28] 1'b1: po_rstn bypass hp_sdio_sys_rstn
 *  [27] 1'b1: po_rstn bypass usb_jtag_chip_rst
 *  [26] 1'b1: po_rstn bypass usb_uart_chip_rst
 *  [25] 1'b1: po_rstn bypass lp_wdt_hp_sys_rstn
 *  [24] 1'b1: po_rstn bypass efuse_err_rstn
 */
#define LPSYSREG_HP_PO_RSTN_BYPASS_CTRL    0x000000FFU
#define LPSYSREG_HP_PO_RSTN_BYPASS_CTRL_M  (LPSYSREG_HP_PO_RSTN_BYPASS_CTRL_V << LPSYSREG_HP_PO_RSTN_BYPASS_CTRL_S)
#define LPSYSREG_HP_PO_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LPSYSREG_HP_PO_RSTN_BYPASS_CTRL_S  24

/** LPSYSREG_RNG_DATA_REG register
 *  rng data register
 */
#define LPSYSREG_RNG_DATA_REG (DR_REG_LP_SYS_BASE + 0x1a4)
/** LPSYSREG_RND_DATA : RO; bitpos: [31:0]; default: 0;
 *  result of rng output
 */
#define LPSYSREG_RND_DATA    0xFFFFFFFFU
#define LPSYSREG_RND_DATA_M  (LPSYSREG_RND_DATA_V << LPSYSREG_RND_DATA_S)
#define LPSYSREG_RND_DATA_V  0xFFFFFFFFU
#define LPSYSREG_RND_DATA_S  0

/** LPSYSREG_LP_CORE_AHB_TIMEOUT_REG register
 *  need_des
 */
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_REG (DR_REG_LP_SYS_BASE + 0x1b0)
/** LPSYSREG_LP_CORE_AHB_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core ahb timeout handle
 */
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_EN    (BIT(0))
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_EN_M  (LPSYSREG_LP_CORE_AHB_TIMEOUT_EN_V << LPSYSREG_LP_CORE_AHB_TIMEOUT_EN_S)
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_EN_V  0x00000001U
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_EN_S  0
/** LPSYSREG_LP_CORE_AHB_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core ahb bus timeout  threshold
 */
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_THRES    0x0000FFFFU
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_THRES_M  (LPSYSREG_LP_CORE_AHB_TIMEOUT_THRES_V << LPSYSREG_LP_CORE_AHB_TIMEOUT_THRES_S)
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_THRES_V  0x0000FFFFU
#define LPSYSREG_LP_CORE_AHB_TIMEOUT_THRES_S  1
/** LPSYSREG_LP2HP_AHB_TIMEOUT_EN : R/W; bitpos: [17]; default: 1;
 *  set this field to 1 to enable lp2hp ahb timeout handle
 */
#define LPSYSREG_LP2HP_AHB_TIMEOUT_EN    (BIT(17))
#define LPSYSREG_LP2HP_AHB_TIMEOUT_EN_M  (LPSYSREG_LP2HP_AHB_TIMEOUT_EN_V << LPSYSREG_LP2HP_AHB_TIMEOUT_EN_S)
#define LPSYSREG_LP2HP_AHB_TIMEOUT_EN_V  0x00000001U
#define LPSYSREG_LP2HP_AHB_TIMEOUT_EN_S  17
/** LPSYSREG_LP2HP_AHB_TIMEOUT_THRES : R/W; bitpos: [22:18]; default: 31;
 *  This field used to set lp2hp ahb bus timeout  threshold
 */
#define LPSYSREG_LP2HP_AHB_TIMEOUT_THRES    0x0000001FU
#define LPSYSREG_LP2HP_AHB_TIMEOUT_THRES_M  (LPSYSREG_LP2HP_AHB_TIMEOUT_THRES_V << LPSYSREG_LP2HP_AHB_TIMEOUT_THRES_S)
#define LPSYSREG_LP2HP_AHB_TIMEOUT_THRES_V  0x0000001FU
#define LPSYSREG_LP2HP_AHB_TIMEOUT_THRES_S  18

/** LPSYSREG_LP_CORE_IBUS_TIMEOUT_REG register
 *  need_des
 */
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_REG (DR_REG_LP_SYS_BASE + 0x1b4)
/** LPSYSREG_LP_CORE_IBUS_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core ibus timeout handle
 */
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_EN    (BIT(0))
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_EN_M  (LPSYSREG_LP_CORE_IBUS_TIMEOUT_EN_V << LPSYSREG_LP_CORE_IBUS_TIMEOUT_EN_S)
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_EN_V  0x00000001U
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_EN_S  0
/** LPSYSREG_LP_CORE_IBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core ibus timeout  threshold
 */
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_THRES    0x0000FFFFU
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_THRES_M  (LPSYSREG_LP_CORE_IBUS_TIMEOUT_THRES_V << LPSYSREG_LP_CORE_IBUS_TIMEOUT_THRES_S)
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define LPSYSREG_LP_CORE_IBUS_TIMEOUT_THRES_S  1

