espressif/esp-idf/components/soc/esp32p4/include/soc/lp_sys_reg.h
/** LPSYSREG_LP_CORE_DBUS_TIMEOUT_REG register
 *  need_des
 */
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_REG (DR_REG_LP_SYS_BASE + 0x1b8)
/** LPSYSREG_LP_CORE_DBUS_TIMEOUT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core dbus timeout handle
 */
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_EN    (BIT(0))
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_EN_M  (LPSYSREG_LP_CORE_DBUS_TIMEOUT_EN_V << LPSYSREG_LP_CORE_DBUS_TIMEOUT_EN_S)
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_EN_V  0x00000001U
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_EN_S  0
/** LPSYSREG_LP_CORE_DBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core dbus timeout  threshold
 */
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_THRES    0x0000FFFFU
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_THRES_M  (LPSYSREG_LP_CORE_DBUS_TIMEOUT_THRES_V << LPSYSREG_LP_CORE_DBUS_TIMEOUT_THRES_S)
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define LPSYSREG_LP_CORE_DBUS_TIMEOUT_THRES_S  1

/** LPSYSREG_LP_CORE_ERR_RESP_DIS_REG register
 *  need_des
 */
#define LPSYSREG_LP_CORE_ERR_RESP_DIS_REG (DR_REG_LP_SYS_BASE + 0x1bc)
/** LPSYSREG_LP_CORE_ERR_RESP_DIS : R/W; bitpos: [2:0]; default: 0;
 *  Set bit0 to disable ibus err resp;Set bit1 to disable dbus err resp; Set bit 2 to
 *  disable ahb err resp.
 */
#define LPSYSREG_LP_CORE_ERR_RESP_DIS    0x00000007U
#define LPSYSREG_LP_CORE_ERR_RESP_DIS_M  (LPSYSREG_LP_CORE_ERR_RESP_DIS_V << LPSYSREG_LP_CORE_ERR_RESP_DIS_S)
#define LPSYSREG_LP_CORE_ERR_RESP_DIS_V  0x00000007U
#define LPSYSREG_LP_CORE_ERR_RESP_DIS_S  0

/** LPSYSREG_RNG_CFG_REG register
 *  rng cfg register
 */
#define LPSYSREG_RNG_CFG_REG (DR_REG_LP_SYS_BASE + 0x1c0)
/** LPSYSREG_RNG_TIMER_EN : R/W; bitpos: [0]; default: 1;
 *  enable rng timer
 */
#define LPSYSREG_RNG_TIMER_EN    (BIT(0))
#define LPSYSREG_RNG_TIMER_EN_M  (LPSYSREG_RNG_TIMER_EN_V << LPSYSREG_RNG_TIMER_EN_S)
#define LPSYSREG_RNG_TIMER_EN_V  0x00000001U
#define LPSYSREG_RNG_TIMER_EN_S  0
/** LPSYSREG_RNG_TIMER_PSCALE : R/W; bitpos: [8:1]; default: 1;
 *  configure ng timer pscale
 */
#define LPSYSREG_RNG_TIMER_PSCALE    0x000000FFU
#define LPSYSREG_RNG_TIMER_PSCALE_M  (LPSYSREG_RNG_TIMER_PSCALE_V << LPSYSREG_RNG_TIMER_PSCALE_S)
#define LPSYSREG_RNG_TIMER_PSCALE_V  0x000000FFU
#define LPSYSREG_RNG_TIMER_PSCALE_S  1
/** LPSYSREG_RNG_SAR_ENABLE : R/W; bitpos: [9]; default: 0;
 *  enable rng_saradc
 */
#define LPSYSREG_RNG_SAR_ENABLE    (BIT(9))
#define LPSYSREG_RNG_SAR_ENABLE_M  (LPSYSREG_RNG_SAR_ENABLE_V << LPSYSREG_RNG_SAR_ENABLE_S)
#define LPSYSREG_RNG_SAR_ENABLE_V  0x00000001U
#define LPSYSREG_RNG_SAR_ENABLE_S  9
/** LPSYSREG_RNG_SAR_DATA : RO; bitpos: [28:16]; default: 0;
 *  debug rng sar sample cnt
 */
#define LPSYSREG_RNG_SAR_DATA    0x00001FFFU
#define LPSYSREG_RNG_SAR_DATA_M  (LPSYSREG_RNG_SAR_DATA_V << LPSYSREG_RNG_SAR_DATA_S)
#define LPSYSREG_RNG_SAR_DATA_V  0x00001FFFU
#define LPSYSREG_RNG_SAR_DATA_S  16

#ifdef __cplusplus
}
#endif
